benchmark/results/wrk-uwsjs-multi.log
== uwsjs [multi] GET /hello  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.51ms  569.83us   7.25ms   87.09%
    Req/Sec   216.66k    25.49k  278.85k    65.35%
  Latency Distribution
     50%    1.31ms
     75%    1.61ms
     90%    2.23ms
     99%    3.74ms
  2178416 requests in 10.11s, 303.31MB read
Requests/sec: 215520.49
Transfer/sec:     30.01MB
== uwsjs [multi] GET /hello  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.44ms    0.92ms  29.31ms   97.39%
    Req/Sec   103.62k     5.85k  113.37k    78.00%
  Latency Distribution
     50%    2.31ms
     75%    2.44ms
     90%    2.74ms
     99%    4.21ms
  2065148 requests in 10.02s, 287.54MB read
Requests/sec: 206002.84
Transfer/sec:     28.68MB
== uwsjs [multi] GET /hello  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.90ms  670.15us  11.02ms   87.51%
    Req/Sec    42.44k     4.31k   87.96k    84.58%
  Latency Distribution
     50%    2.75ms
     75%    3.02ms
     90%    3.53ms
     99%    5.83ms
  1698108 requests in 10.10s, 236.44MB read
Requests/sec: 168054.25
Transfer/sec:     23.40MB
== uwsjs [multi] GET /hello  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.14ms    0.98ms  31.96ms   92.63%
    Req/Sec    19.66k     1.51k   29.59k    76.88%
  Latency Distribution
     50%    2.92ms
     75%    3.31ms
     90%    3.86ms
     99%    6.18ms
  1566998 requests in 10.03s, 218.18MB read
Requests/sec: 156297.91
Transfer/sec:     21.76MB
== uwsjs [multi] GET /hello/inon  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello/inon
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.78ms  691.45us  10.61ms   79.74%
    Req/Sec   173.21k    10.37k  194.00k    71.00%
  Latency Distribution
     50%    2.65ms
     75%    2.96ms
     90%    3.58ms
     99%    5.47ms
  1723120 requests in 10.01s, 238.28MB read
Requests/sec: 172158.50
Transfer/sec:     23.81MB
== uwsjs [multi] GET /hello/inon  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello/inon
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.77ms    1.48ms  39.46ms   95.74%
    Req/Sec    92.65k    15.20k  109.36k    77.50%
  Latency Distribution
     50%    2.41ms
     75%    2.87ms
     90%    3.40ms
     99%    7.24ms
  1844980 requests in 10.02s, 255.13MB read
Requests/sec: 184067.78
Transfer/sec:     25.45MB
== uwsjs [multi] GET /hello/inon  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello/inon
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.83ms  676.66us  14.96ms   89.96%
    Req/Sec    44.24k     5.13k   52.55k    81.75%
  Latency Distribution
     50%    2.62ms
     75%    2.94ms
     90%    3.48ms
     99%    5.60ms
  1760895 requests in 10.01s, 243.50MB read
Requests/sec: 175973.85
Transfer/sec:     24.33MB
== uwsjs [multi] GET /hello/inon  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/hello/inon
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.88ms    1.17ms  37.94ms   95.61%
    Req/Sec    21.92k     3.59k   77.99k    92.52%
  Latency Distribution
     50%    2.71ms
     75%    2.91ms
     90%    3.36ms
     99%    5.74ms
  1750423 requests in 10.10s, 242.05MB read
Requests/sec: 173229.87
Transfer/sec:     23.95MB
== uwsjs [multi] GET /db  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/db
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.24ms    1.31ms  30.08ms   94.95%
    Req/Sec   119.96k    15.94k  141.44k    84.00%
  Latency Distribution
     50%    3.93ms
     75%    4.37ms
     90%    4.98ms
     99%    9.80ms
  1192744 requests in 10.01s, 224.86MB read
Requests/sec: 119196.77
Transfer/sec:     22.47MB
== uwsjs [multi] GET /db  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/db
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.03ms    1.13ms  31.47ms   94.26%
    Req/Sec    62.90k     7.80k   73.96k    79.21%
  Latency Distribution
     50%    3.82ms
     75%    4.10ms
     90%    4.74ms
     99%    8.36ms
  1263551 requests in 10.10s, 238.21MB read
Requests/sec: 125057.18
Transfer/sec:     23.58MB
== uwsjs [multi] GET /db  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/db
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.87ms  832.95us  20.36ms   92.30%
    Req/Sec    32.45k     3.33k   41.46k    87.13%
  Latency Distribution
     50%    3.66ms
     75%    3.98ms
     90%    4.47ms
     99%    7.51ms
  1304363 requests in 10.10s, 245.90MB read
Requests/sec: 129101.35
Transfer/sec:     24.34MB
== uwsjs [multi] GET /db  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/db
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.85ms    1.05ms  24.10ms   92.00%
    Req/Sec    16.27k     2.67k   46.46k    88.40%
  Latency Distribution
     50%    3.57ms
     75%    3.96ms
     90%    4.51ms
     99%    8.63ms
  1299601 requests in 10.10s, 245.00MB read
Requests/sec: 128619.61
Transfer/sec:     24.25MB
== uwsjs [multi] POST /echo  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/echo
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.01ms  794.18us  21.36ms   94.12%
    Req/Sec   167.88k    19.08k  183.80k    91.00%
  Latency Distribution
     50%    2.80ms
     75%    3.05ms
     90%    3.51ms
     99%    6.54ms
  1668159 requests in 10.01s, 279.99MB read
Requests/sec: 166713.77
Transfer/sec:     27.98MB
== uwsjs [multi] POST /echo  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/echo
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.01ms    0.88ms  28.23ms   95.73%
    Req/Sec    84.16k     8.67k   94.93k    92.08%
  Latency Distribution
     50%    2.80ms
     75%    3.06ms
     90%    3.47ms
     99%    6.51ms
  1691446 requests in 10.10s, 283.90MB read
Requests/sec: 167410.01
Transfer/sec:     28.10MB
== uwsjs [multi] POST /echo  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/echo
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.98ms  632.78us  18.27ms   92.46%
    Req/Sec    42.32k     7.52k  171.13k    94.26%
  Latency Distribution
     50%    2.84ms
     75%    3.06ms
     90%    3.40ms
     99%    5.67ms
  1688024 requests in 10.10s, 283.33MB read
Requests/sec: 167094.03
Transfer/sec:     28.05MB
== uwsjs [multi] POST /echo  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/echo
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.94ms  660.22us  20.64ms   91.83%
    Req/Sec    21.18k     3.86k   84.32k    92.39%
  Latency Distribution
     50%    2.79ms
     75%    3.03ms
     90%    3.37ms
     99%    5.74ms
  1690950 requests in 10.10s, 283.82MB read
Requests/sec: 167408.44
Transfer/sec:     28.10MB
== uwsjs [multi] POST /query  t=1 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/query
  1 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.10ms    3.24ms  83.69ms   93.29%
    Req/Sec   104.78k    26.36k  133.02k    80.00%
  Latency Distribution
     50%    4.24ms
     75%    4.79ms
     90%    6.70ms
     99%   18.82ms
  1042699 requests in 10.02s, 193.91MB read
Requests/sec: 104111.63
Transfer/sec:     19.36MB
== uwsjs [multi] POST /query  t=2 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/query
  2 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.82ms    2.84ms  75.60ms   96.79%
    Req/Sec    54.06k     9.08k  117.99k    92.54%
  Latency Distribution
     50%    4.43ms
     75%    4.81ms
     90%    5.35ms
     99%   12.85ms
  1081236 requests in 10.10s, 201.07MB read
Requests/sec: 107019.96
Transfer/sec:     19.90MB
== uwsjs [multi] POST /query  t=4 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/query
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.35ms  842.73us  28.50ms   94.66%
    Req/Sec    28.99k     2.67k   34.86k    93.32%
  Latency Distribution
     50%    4.16ms
     75%    4.50ms
     90%    4.91ms
     99%    8.26ms
  1165194 requests in 10.10s, 216.69MB read
Requests/sec: 115320.31
Transfer/sec:     21.45MB
== uwsjs [multi] POST /query  t=8 c=500 d=10s ==
Running 10s test @ http://127.0.0.1:3003/query
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.33ms    0.92ms  22.38ms   92.90%
    Req/Sec    14.39k     3.84k  113.25k    92.51%
  Latency Distribution
     50%    4.15ms
     75%    4.50ms
     90%    4.99ms
     99%    8.45ms
  1147402 requests in 10.10s, 213.38MB read
Requests/sec: 113600.36
Transfer/sec:     21.13MB